PREFIX att: <http://data.barcelona.cat/att/>
PREFIX rel: <http://data.barcelona.cat/rel/>
PREFIX base: <http://data.barcelona.cat/actividades/>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>

# Todas las actividades con su titulo, tipo, precio, fechaInicio y fechaFin con su respectivo organizador.
SELECT ?actividad ?titulo ?tipo ?precio ?fechaInicio ?fechaFin ?organizador
WHERE {
  ?actividad a base:Actividad ;
            att:titulo ?titulo ;
            att:precio ?precio ;
            att:fechaInicio ?fechaInicio ;
            att:fechaFin ?fechaFin ;
  			rel:isHosted ?organizador .
}
ORDER BY ?fechaInicio



# Contea las actividades gratuitas (gratuïta) y las de pago (pagament)

SELECT ?tipo (COUNT(*) as ?cantidad)
WHERE {
  ?actividad a base:Actividad ;
            att:tipo ?tipo .
}
GROUP BY ?tipo



# Ver todas las relaciones utilizadas en el dataset

SELECT DISTINCT ?predicado (COUNT(*) as ?uso)
WHERE {
  ?s ?predicado ?o .
  FILTER(STRSTARTS(STR(?predicado), "http://data.barcelona.cat/rel/"))
}
GROUP BY ?predicado
ORDER BY DESC(?uso)


#"Mapa de calor" de la oferta de actividades segun localización (tendria que funcionar cuando la relacion ns2:isContained funcione)
SELECT ?municipio ?organizador ?categoria
       (COUNT(?actividad) as ?numActividades)
       (SUM(xsd:integer(?aforo)) as ?aforoAcumulado)
       (GROUP_CONCAT(DISTINCT ?titulo; SEPARATOR="; ") as ?ejemplosActividades)
WHERE {
  ?actividad a base:Actividad ;
             att:titulo ?titulo ;
             att:aforo ?aforo ;
             rel:isHosted ?organizador ;
             rel:typeOf ?categoria ;
             rel:placed ?municipio .
  
}
GROUP BY ?comarca ?municipio ?organizador ?categoria
HAVING (COUNT(?actividad) >= 1)
ORDER BY ?comarca ?municipio ?organizador DESC(?numActividades)


# Dada un conjunto de Actividades, encontrar sus correspondientes organizadores
SELECT ?actividad ?organizador
WHERE {
  ?actividad a base:Actividad ;
             rel:isHosted ?organizador .
}
LIMIT 20




# Dado un conjunto de Municipio, encontrar la Comarca en la que está contenida (isContained)
SELECT ?municipio ?comarca
WHERE {
  ?municipio rel:isContained ?comarca .
}
ORDER BY ?municipio
LIMIT 20




# Dado un conjunto de Municipio, encontrar las Actividad correspondientes (placed)
SELECT ?municipio ?actividad
WHERE {
  ?actividad a base:Actividad ;
             rel:placed ?municipio ;
}
ORDER BY ?municipio
LIMIT 20


# Encuentra actividades y sus organizadores vinculados a Wikidata:Municipio
SELECT ?actividad ?organizador ?wikidata
WHERE {
  ?actividad rel:isHosted ?organizador .
  ?organizador owl:sameAs ?wikidata .
}


# Encuentra actividades y los municipios vinculados a Wikidata:Municipio
SELECT ?actividad ?municipio ?wikidata
WHERE {
  ?actividad rel:placed ?municipio .
  ?municipio owl:sameAs ?wikidata .
}
LIMIT 20



# Relaciona municipios con comarcas y sus equivalentes en Wikidata
SELECT ?municipio ?comarca ?wikidata
WHERE {
  ?municipio rel:isContained ?comarca .
  ?comarca owl:sameAs ?wikidata .
}
LIMIT 20
